\chapter{Технологический раздел}
\section{Требования к программному обеспечению}
Программа должна отвечать следующим требованиям:
\begin{itemize}
	\item на вход программе подаются два массива целых сгенерированных чисел, корректный размер которых задает пользователь;
	\item осуществляется выбор алгоритма умножения матриц из меню;
	\item на вход программе подаются только корректные данные данные;
	\item на выходе программа выдает результат - полученную матрицу.
\end{itemize}

\section{Выбор средств реализации}
Для реализации алгоритмов в данной лабораторной работе был выбран язык программирования Python 3.9.7\cite{python3}. На нем можно выполнять быструю разработку программ. Имеется опыт разработки на этом языке. В качестве среды разработки был использован Visual Studio Code\cite{vs}, так как в нем присутсвует поддержка практически всех языков программирования. При замере процессорного времени был использован модуль time\cite{time}.

\section{Листинги программ}
Ниже представлены листинги разработанных алгоритмов умножения матриц.
\newpage
\begin{lstlisting}[label = ordinary_mult, caption=Программный код умножения матриц стандартным способом.]
def multiply_matrixes_ordinary(matrix_a, matrix_b) -> list[list[int]]:
	n, m = matrix_a.get_size()
	q, p = matrix_b.get_size()
	if m != q:
		print('Dismatch matrix sizes.')
		return
	else:
		matrix_result = Matrix(n, p)
	for i in range(n):
		for j in range(p):
			for k in range(m):
				matrix_result[i][j] = matrix_result[i][j] + \
									matrix_a[i][k] * matrix_b[k][j]
	return matrix_result
\end{lstlisting}
\newpage
\begin{lstlisting}[label=vinograd_mult,caption=Программный код умножения матриц по Винограду.]
def multiply_matrixes_vinograd(matrix_a, matrix_b) -> list[list[int]]:
	n, m = matrix_a.get_size()
	q, p = matrix_b.get_size()
	if m != q:
		print('Dismatch matrix sizes.')
		return
	else:
		matrix_result = Matrix(n, p)
		d = int(m / 2)
		mul_u = [0] * n
		for i in range(n):
			for j in range(d):
				mul_u[i] = mul_u[i] + \
							matrix_a[i][2*j] * matrix_a[i][2*j + 1]
		
		mul_w = [0] * p
		for i in range(p):
			for j in range(d):
				mul_w[i] = mul_w[i] + \
							matrix_b[2*j][i] * matrix_b[2*j + 1][i]
		
		for i in range(n):
			for j in range(p):
				matrix_result[i][j] = -mul_u[i] - mul_w[j]
				for k in range(d):
					matrix_result[i][j] = matrix_result[i][j] + \
					(matrix_a[i][2*k] + matrix_b[2*k+1][j]) * \
					(matrix_a[i][2*k+1] + matrix_b[2*k][j])
		
		if m % 2 == 1:
			for i in range(n):
				for j in range(p):
					matrix_result[i][j] = matrix_result[i][j] + \
								matrix_a[i][m-1] * matrix_b[m-1][j]
		
		return matrix_result
\end{lstlisting}
\newpage
\begin{lstlisting}[label=optim_vinograd, caption=Программный код оптимизированного алгоритма умножения матриц по Винограду.]
def multiply_matrixes_vinograd_optimized(matrix_a, matrix_b) -> list[list[int]]:
	n, m = matrix_a.get_size()
	q, p = matrix_b.get_size()
	if m != q:
		print('Dismatch matrix sizes.')
		return
	else:
		matrix_result = Matrix(n, p)
		is_odd = m % 2
		dec_m = m - 1
		mul_u = [0] * n
		if is_odd:
			m -= 1
		for i in range(n):
			buf = 0
			for j in range(0, m, 2):
				buf += matrix_a[i][j] * matrix_a[i][j + 1]
			mul_u[i] = buf
		
		mul_w = [0] * p
		for i in range(p):
			buf = 0
			for j in range(0, m, 2):
				buf += matrix_b[j][i] * matrix_b[j + 1][i]
			mul_w[i] = buf
		
		for i in range(n):
			for j in range(p):
				buf = -(mul_u[i] + mul_w[j])
				for k in range(0, m, 2):
					buf += (matrix_a[i][k] + matrix_b[k+1][j]) * \
							(matrix_a[i][k+1] + matrix_b[k][j])
		
				if is_odd == 1:
					buf += matrix_a[i][dec_m] * matrix_b[dec_m][j]
				matrix_result[i][j] = buf
		
		return matrix_result
\end{lstlisting}

\section{Вспомогательные модули}
На листингах представлены программные модули, которые используются в данных функциях:
\begin{lstlisting}[label=lst:struct_matrix,caption=Программный код класса по работе с матрицами.]
class Matrix():
	def __init__(self, n, m):
		self.__n, self.__m = n, m
		self.create_matrix()
	
	def create_matrix(self):
		self.matrix = [[0] * self.__m for i in range(self.__n)]
	
	def output_matrix(self):
		for i in range(self.__n):
			for j in range(self.__m):
				print(self.matrix[i][j], end=' ')
			print()
	
	def __getitem__(self, index):
		return self.matrix[index]
	
	def __setitem__(self, key, value):
		self.matrix[key] = value
	
	def get_size(self):
		return self.__n, self.__m
	
	def fill_matrix_random_values(self):
		for i in range(self.__n):
		for j in range(self.__m):
			self.matrix[i][j] = randint(MIN_RAND, MAX_RAND)
\end{lstlisting}

\section{Тестирование}
Для тестирования используется метод черного ящика. В данном разделе приведена таблица \ref{table:ref1}, в которой указаны классы эквивалентностей тестов: \\

\begin{table}[ht!]
	\centering
	\captionsetup{singlelinecheck = false, justification=raggedleft}
	\caption{Таблица тестов}
	\label{table:ref1}
	\begin{tabular}{|c|c|c|c|c|}
		\hline
		№ &Описание теста & Матрица 1  &  Матрица 2   &  Ожидаемый результат\\\hline
		1& Квадратный размер  & $\begin{pmatrix}6 & 9 & 8\\0 & 3 & 6\\4 & 9 & 5\end{pmatrix}$
							  & $\begin{pmatrix}9 & 6 & 0\\2 & 3 & 5\\6 & 8 & 7\end{pmatrix}$
							  & $\begin{pmatrix}120 & 127 & 101\\42 & 57 & 57\\84 & 91 & 80\end{pmatrix}$
		\\ \hline
		2& Разный размер	  & $\begin{pmatrix}2 & 3 & 2\\3 & 9 & 2\end{pmatrix}$
							  & $\begin{pmatrix}2 & 4\\1 & 7\\4 & 1\end{pmatrix}$
							  & $\begin{pmatrix}15 & 31\\23 & 77\end{pmatrix}$
		\\ \hline
		3&Разный размер		& $\begin{pmatrix}5 & 1\\0 & 4\\6 & 4\end{pmatrix}$
							& $\begin{pmatrix}2 & 1 & 7\\4 & 6 & 1\end{pmatrix}$
							& $\begin{pmatrix}14 & 11 & 36\\16 & 24 & 4\\28 & 30 & 46\end{pmatrix}$
		\\ \hline
		\multirow{2}{*}{4}  &\multirow{2}{*}{Неподходящий} 
								& \multirow{2}{*}{$\begin{pmatrix}5 & 1\\0 & 4\end{pmatrix}$}
								& \multirow{2}{*}{$\begin{pmatrix}5 & 1\\0 & 4\end{pmatrix}$}
								& \multirow{2}{*}{Несоответствие}\\
		&размер & & &размеров.
		\\ \hline
	\end{tabular}
\end{table}
	Для алгоритмов умножения матриц стандартным образом, по Винограду и оптимизированный по Винограду данные тесты были пройдены успешно.
\section*{Вывод}
В данном разделе был выбран язык программирования, среда разработки. Реализованы функции, описанные в аналитическом разделе, и проведено их тестирование методом черного ящика по таблице \ref{table:ref1}. 

